[
    {
        "video_url": "https://storage.googleapis.com/msgsndr/ksEQOsPCPU4ZxMjjK0GL/media/66a4976ea57ce5a1e45ccbbc.mp4",
        "video_thumb": "https://storage.googleapis.com/msgsndr/ksEQOsPCPU4ZxMjjK0GL/media/66a49c06161e92edf7539443.webp",
        "movie_name": "Tangled Rapunzel Meets Flynn Ryder",
        "examples": [
            {
                "en": "Oh no, where is my satchel? I've hidden it somewhere you'll never find it.",
                "ar": "أوه لا، أين حقيبتي؟ لقد خبأتها في مكان لن تجده أبدًا."
            },
            {
                "en": "It's in that pot, isn't it?",
                "ar": "إنها في ذلك الإناء، أليس كذلك؟"
            },
            {
                "en": "Now it's hidden where you'll never find it.",
                "ar": "الآن هي مخبأة في مكان لن تجده فيه أبدًا."
            },
            {
                "en": "So, what do you want with my hair? To cut it?",
                "ar": "إذاً، ماذا تريدين من شعري؟ قصه؟"
            },
            {
                "en": "What? Sell it?",
                "ar": "ماذا؟ بيعه؟"
            },
            {
                "en": "No, listen, the only thing I want to do with your hair is to get out of it, literally.",
                "ar": "لا، اسمعي، الشيء الوحيد الذي أريد فعله بشعرك هو الخروج منه، حرفياً."
            },
            {
                "en": "Wait, you don't want my hair?",
                "ar": "انتظر، أنت لا تريد شعري؟"
            },
            {
                "en": "Why on earth would I want your hair?",
                "ar": "لماذا قد أريد شعرك على الأرض؟"
            },
            {
                "en": "Look, I was being chased, I saw a tower, I climbed it, and the story.",
                "ar": "انظري، كنت مطاردًا، رأيت برجًا، صعدته، وهذه هي القصة."
            },
            {
                "en": "You're telling the truth?",
                "ar": "أنت تقول الحقيقة؟"
            },
            {
                "en": "Yes!",
                "ar": "نعم!"
            },
            {
                "en": "Doesn't it seem so?",
                "ar": "أليس كذلك؟"
            },
            {
                "en": "But what choice do I have?",
                "ar": "لكن ما الخيار الذي لدي؟"
            },
            {
                "en": "Oh, okay, fine.",
                "ar": "أوه، حسناً، تمام."
            },
            {
                "en": "I'm prepared to offer you a deal.",
                "ar": "أنا مستعدة لتقديم صفقة لك."
            },
            {
                "en": "A deal?",
                "ar": "صفقة؟"
            },
            {
                "en": "Look this way.",
                "ar": "انظر في هذا الاتجاه."
            },
            {
                "en": "You know what these are?",
                "ar": "هل تعرف ما هذه؟"
            },
            {
                "en": "You mean the lantern things they do for the princess?",
                "ar": "تقصد الفوانيس التي يقومون بها للأميرة؟"
            },
            {
                "en": "I knew they weren't stars.",
                "ar": "كنت أعلم أنها لم تكن نجوماً."
            },
            {
                "en": "Well, tomorrow evening they will light the night sky with these lanterns.",
                "ar": "حسنًا، مساء الغد سيضيئون السماء الليلية بهذه الفوانيس."
            },
            {
                "en": "You will act as my guide, take me to these lanterns, and return me home safely.",
                "ar": "سوف تعمل كدليلي، تأخذني إلى هذه الفوانيس، وتعيدني إلى المنزل بأمان."
            },
            {
                "en": "Then, and only then, will I return your satchel to you. That is my deal.",
                "ar": "عندها، وفقط عندها، سأعيد لك حقيبتك. هذه هي صفقتي."
            },
            {
                "en": "Yeah, no can do. Unfortunately, the kingdom and I aren't exactly simpatico at the moment, so I won't be taking you anywhere.",
                "ar": "نعم، لا أستطيع. لسوء الحظ، المملكة وأنا لسنا متوافقين في الوقت الحالي، لذا لن آخذك إلى أي مكان."
            },
            {
                "en": "Something brought you here, Flynn Ryder. Call it what you will: fate, destiny.",
                "ar": "شيء ما جلبك إلى هنا، فلين رايدر. سمه ما شئت: القدر، المصير."
            },
            {
                "en": "A horse.",
                "ar": "حصان."
            },
            {
                "en": "So, I have made the decision to trust you.",
                "ar": "لذلك، اتخذت قراراً بالثقة بك."
            },
            {
                "en": "A horrible decision, really.",
                "ar": "قرار رهيب، حقاً."
            },
            {
                "en": "But trust me when I tell you this: you can tear this tower apart brick by brick, but without my help, you will never find your precious satchel.",
                "ar": "لكن ثق بي عندما أخبرك بهذا: يمكنك تمزيق هذا البرج حجراً حجراً، لكن بدون مساعدتي، لن تجد حقيبتك الثمينة أبداً."
            },
            {
                "en": "Let me just get this straight. I take you to see the lanterns, bring you back home, and you'll give me back my satchel?",
                "ar": "دعني أتأكد من هذا. آخذك لرؤية الفوانيس، أعيدك إلى المنزل، وستعيد لي حقيبتي؟"
            },
            {
                "en": "I promise. And when I promise something, I never ever break that promise. Ever.",
                "ar": "أعدك. وعندما أعد بشيء، لا أكسر ذلك الوعد أبداً. أبداً."
            },
            {
                "en": "All right, listen, I didn't want to have to do this, but you leave me no choice. Here comes the smolder.",
                "ar": "حسناً، اسمعي، لم أكن أرغب في القيام بذلك، لكنك لم تتركي لي خياراً. ها هو التعبير الجذاب."
            },
            {
                "en": "This is kind of an off day for me. This doesn't normally happen.",
                "ar": "هذا يوم سيء بالنسبة لي. هذا لا يحدث عادة."
            },
            {
                "en": "Fine, I'll take you to see the lanterns.",
                "ar": "حسناً، سأخذك لرؤية الفوانيس."
            },
            {
                "en": "You broke my smolder.",
                "ar": "لقد حطمت تعبير وجهي الجذاب."
            }
        ]
    },
    {
        "video_url": "https://storage.googleapis.com/msgsndr/ksEQOsPCPU4ZxMjjK0GL/media/66a4c2713c9fe005c641c424.mp4",
        "video_thumb": "https://storage.googleapis.com/msgsndr/ksEQOsPCPU4ZxMjjK0GL/media/66a49c06161e92edf7539443.webp",
        "movie_name": "Captain America: The First Avenger",
        "examples": [
            {
                "en": "Gentlemen, I'm Agent Carson. I supervise all operations for this division.",
                "ar": "أيها السادة، أنا العميل كارسون. أشرف على جميع العمليات لهذا القسم."
            },
            {
                "en": "What's with the accent, Queen Victoria? Thought I was signing up for the US Army.",
                "ar": "ما هذا اللكنة، الملكة فيكتوريا؟ اعتقدت أنني كنت أنضم إلى الجيش الأمريكي."
            },
            {
                "en": "What's your name, soldier?",
                "ar": "ما اسمك، أيها الجندي؟"
            },
            {
                "en": "Gilmore Hodge.",
                "ar": "غيلمور هودج."
            },
            {
                "en": "In there. Justine, step forward.",
                "ar": "هناك. جاستن، تقدم للأمام."
            },
            {
                "en": "Hodge, 'cause I got a few moves I know you'll like.",
                "ar": "هودج، لأن لدي بعض الحركات التي أعلم أنك ستحبها."
            },
            {
                "en": "Garnet, get your ass up out of that dirt and stand on that line at attention till somebody come tells you what to do.",
                "ar": "غارنيت، انهض من تلك الأرض وابق واقفاً على ذلك الخط منتبهاً حتى يأتي شخص ما ليخبرك بما يجب عليك فعله."
            },
            {
                "en": "Yes, sir!",
                "ar": "نعم، سيدي!"
            },
            {
                "en": "Wars are fought with weapons, but they are won by men. We are going to win this war because we have the best men, and because they are going to get better. Much better.",
                "ar": "تُخاض الحروب بالأسلحة، ولكن الرجال هم الذين يكسبونها. سنفوز بهذه الحرب لأن لدينا أفضل الرجال، ولأنهم سيصبحون أفضل. أفضل بكثير."
            },
            {
                "en": "That flag means we're only at the halfway point. The first man that brings it to me gets a ride back with Agent Carter.",
                "ar": "تلك الراية تعني أننا فقط في منتصف الطريق. أول رجل يجلبها لي يحصل على رحلة العودة مع العميلة كارتر."
            },
            {
                "en": "Look at that, he's making me cry.",
                "ar": "انظر إلى ذلك، إنه يجعلني أبكي."
            },
            {
                "en": "I am looking for qualities beyond the physical.",
                "ar": "أنا أبحث عن صفات تتجاوز الجسدية."
            },
            {
                "en": "Do you know how long it took to set up this project?",
                "ar": "هل تعلم كم من الوقت استغرق إعداد هذا المشروع؟"
            },
            {
                "en": "I know. I am well aware of your efforts.",
                "ar": "أعلم. أنا على دراية جيدة بجهودك."
            },
            {
                "en": "Then throw me a bone. Hodge passed every test we gave him. He's big, he's fast, he obeys orders. He's a soldier.",
                "ar": "إذاً قدم لي مساعدة. هودج اجتاز كل اختبار قدمناه له. إنه كبير، سريع، ويطيع الأوامر. إنه جندي."
            },
            {
                "en": "It's a bully, not a soldier.",
                "ar": "إنه متنمر، وليس جندياً."
            },
            {
                "en": "Nice doesn't win wars.",
                "ar": "اللطف لا يكسب الحروب."
            },
            {
                "en": "For me, it does.",
                "ar": "بالنسبة لي، يكسب."
            },
            {
                "en": "Is this a test?",
                "ar": "هل هذا اختبار؟"
            },
            {
                "en": "Dramatic fusion, beginning in three... two...",
                "ar": "الانصهار الدرامي، يبدأ في ثلاث... اثنتين..."
            },
            {
                "en": "What now, Mr. Stark?",
                "ar": "ماذا الآن، السيد ستارك؟"
            },
            {
                "en": "Steve, can you hear me?",
                "ar": "ستيف، هل تسمعني؟"
            },
            {
                "en": "Probably too late to go to the bathroom, right?",
                "ar": "ربما فات الأوان للذهاب إلى الحمام، صحيح؟"
            },
            {
                "en": "Proceed.",
                "ar": "استمر."
            },
            {
                "en": "10 percent... 20 percent... 30 percent...",
                "ar": "10 بالمئة... 20 بالمئة... 30 بالمئة..."
            },
            {
                "en": "Somebody did it.",
                "ar": "شخص ما فعلها."
            },
            {
                "en": "How do you feel?",
                "ar": "كيف تشعر؟"
            },
            {
                "en": "Taller.",
                "ar": "أطول."
            }
        ]
    }
]
