[
    {
        "english": "What is the foundation of this building made of?",
        "arabic": "مم يتكون أساس هذا المبنى؟"
    },
    {
        "english": "We need to conduct a soil test before construction.",
        "arabic": "نحتاج إلى إجراء اختبار التربة قبل البناء."
    },
    {
        "english": "The project requires a detailed structural analysis.",
        "arabic": "يتطلب المشروع تحليلًا هيكليًا مفصلًا."
    },
    {
        "english": "How long will the construction phase take?",
        "arabic": "كم ستستغرق مرحلة البناء؟"
    },
    {
        "english": "We need to ensure the safety of the construction site.",
        "arabic": "نحتاج إلى ضمان سلامة موقع البناء."
    },
    {
        "english": "The concrete mix should meet the required standards.",
        "arabic": "يجب أن يلبي خليط الخرسانة المعايير المطلوبة."
    },
    {
        "english": "What is the load-bearing capacity of this structure?",
        "arabic": "ما هي قدرة التحمل لهذه البنية؟"
    },
    {
        "english": "We need to submit the design plans for approval.",
        "arabic": "نحتاج إلى تقديم خطط التصميم للموافقة عليها."
    },
    {
        "english": "The building must comply with local building codes.",
        "arabic": "يجب أن يمتثل المبنى لقوانين البناء المحلية."
    },
    {
        "english": "The surveyors are mapping out the site boundaries.",
        "arabic": "يقوم المساحون برسم حدود الموقع."
    },
    {
        "english": "What type of materials are we using for the project?",
        "arabic": "ما نوع المواد التي نستخدمها في المشروع؟"
    },
    {
        "english": "We need to calculate the total load on the structure.",
        "arabic": "نحتاج إلى حساب الحمل الكلي على الهيكل."
    },
    {
        "english": "Ensure that all workers wear their safety gear.",
        "arabic": "تأكد من ارتداء جميع العمال لمعدات السلامة الخاصة بهم."
    },
    {
        "english": "The bridge design must account for environmental factors.",
        "arabic": "يجب أن يأخذ تصميم الجسر في الاعتبار العوامل البيئية."
    },
    {
        "english": "We need to perform a site inspection.",
        "arabic": "نحتاج إلى إجراء فحص للموقع."
    },
    {
        "english": "The drainage system needs to be efficient.",
        "arabic": "يجب أن يكون نظام الصرف فعالاً."
    },
    {
        "english": "What is the expected lifespan of this building?",
        "arabic": "ما هي المدة المتوقعة لعمر هذا المبنى؟"
    },
    {
        "english": "We are using sustainable materials for this project.",
        "arabic": "نستخدم مواد مستدامة لهذا المشروع."
    },
    {
        "english": "The contractor must follow the project timeline strictly.",
        "arabic": "يجب على المقاول الالتزام بجدول المشروع بدقة."
    },
    {
        "english": "We need to install the steel reinforcements properly.",
        "arabic": "نحتاج إلى تثبيت التعزيزات الفولاذية بشكل صحيح."
    },
    {
        "english": "The pavement design should withstand heavy traffic.",
        "arabic": "يجب أن يتحمل تصميم الرصف حركة المرور الكثيفة."
    },
    {
        "english": "What is the budget for this construction project?",
        "arabic": "ما هو ميزانية مشروع البناء هذا؟"
    },
    {
        "english": "We need to consider seismic activity in the design.",
        "arabic": "نحتاج إلى مراعاة النشاط الزلزالي في التصميم."
    },
    {
        "english": "The project manager will oversee the construction progress.",
        "arabic": "سيتولى مدير المشروع الإشراف على تقدم البناء."
    },
    {
        "english": "Ensure proper alignment of all structural components.",
        "arabic": "تأكد من محاذاة جميع المكونات الهيكلية بشكل صحيح."
    },
    {
        "english": "The water supply system needs to be installed correctly.",
        "arabic": "يجب تثبيت نظام إمدادات المياه بشكل صحيح."
    },
    {
        "english": "We need to evaluate the environmental impact of the project.",
        "arabic": "نحتاج إلى تقييم التأثير البيئي للمشروع."
    },
    {
        "english": "The final inspection will be conducted next week.",
        "arabic": "سيتم إجراء الفحص النهائي الأسبوع المقبل."
    },
    {
        "english": "The design team will provide the blueprints.",
        "arabic": "ستقوم فريق التصميم بتوفير المخططات."
    },
    {
        "english": "We need to maintain quality control throughout the construction process.",
        "arabic": "نحتاج إلى الحفاظ على مراقبة الجودة طوال عملية البناء."
    },
    {
        "english": "The building's foundation needs to be reinforced.",
        "arabic": "يجب تعزيز أساس المبنى."
    },
    {
        "english": "The construction site needs to be properly fenced off.",
        "arabic": "يجب تسييج موقع البناء بشكل صحيح."
    },
    {
        "english": "The project timeline must be adhered to.",
        "arabic": "يجب الالتزام بجدول المشروع."
    },
    {
        "english": "The design must be both functional and aesthetic.",
        "arabic": "يجب أن يكون التصميم وظيفيًا وجماليًا."
    },
    {
        "english": "What is the height limit for buildings in this area?",
        "arabic": "ما هو الحد الأقصى لارتفاع المباني في هذه المنطقة؟"
    },
    {
        "english": "The site engineer will oversee daily operations.",
        "arabic": "سيشرف المهندس الميداني على العمليات اليومية."
    },
    {
        "english": "We need to source high-quality construction materials.",
        "arabic": "نحتاج إلى الحصول على مواد بناء عالية الجودة."
    },
    {
        "english": "The building must be energy efficient.",
        "arabic": "يجب أن يكون المبنى موفرًا للطاقة."
    },
    {
        "english": "We need to prepare the site before construction begins.",
        "arabic": "نحتاج إلى تجهيز الموقع قبل بدء البناء."
    },
    {
        "english": "The structural integrity of the building is paramount.",
        "arabic": "السلامة الهيكلية للمبنى هي الأهم."
    }
]
