[
    {
      "english": "Going to the beach is a popular activity for people of all ages. It's a great way to relax, soak up the sun, and enjoy the refreshing water.",
      "arabic": "يعد الذهاب إلى الشاطئ نشاطًا شائعًا للأشخاص من جميع الأعمار. إنها طريقة رائعة للاسترخاء والاستمتاع بالشمس والاستمتاع بالمياه المنعشة."
    },
    {
      "english": "Before you head to the beach, there are a few things to keep in mind:",
      "arabic": "قبل التوجه إلى الشاطئ ، هناك بعض الأشياء التي يجب وضعها في الاعتبار:"
    },
    {
      "english": "* Check the weather forecast. You don't want to get caught in a storm!",
      "arabic": "* تحقق من توقعات الطقس. لا تريد أن تتعرض لعاصفة!"
    },
    {
      "english": "* Pack sunscreen, sunglasses, and a hat to protect yourself from the sun.",
      "arabic": "* ضع واقيًا من الشمس ونظارات الشمس وقبعة لحماية نفسك من أشعة الشمس."
    },
    {
      "english": "* Bring a beach towel, swimsuit, and change of clothes.",
      "arabic": "* احضر منشفة شاطئية وملابس سباحة وملابس للبديل."
    },
    {
      "english": "* Consider packing some snacks and drinks, especially if you're planning on spending a long day at the beach.",
      "arabic": "* فكر في اصطحاب بعض الوجبات الخفيفة والمشروبات ، خاصة إذا كنت تخطط لقضاء يوم طويل على الشاطئ."
    },
    {
      "english": "* Don't forget to pack beach chairs or an umbrella if you want to shade yourself from the sun.",
      "arabic": "* لا تنسى إحضار كراسي استراحة أو مظلة إذا كنت تريد حجب أشعة الشمس عن نفسك."
    },
    {
      "english": "Here are some fun activities you can enjoy at the beach:",
      "arabic": "فيما يلي بعض الأنشطة الترفيهية التي يمكنك الاستمتاع بها على الشاطئ:"
    },
    {
      "english": "* Swimming and sunbathing",
      "arabic": "* السباحة وحمامات الشمس",
      "image": "Image of Swimming at the beach"
    },
    {
      "english": "* Building sandcastles",
      "arabic": "* بناء قلاع الرمل",
      "image": "Image of Building sandcastles at the beach"
    },
    {
      "english": "* Beach volleyball",
      "arabic": "* الكرة الطائرة الشاطئية",
      "image": "Image of Beach volleyball"
    },
    {
      "english": "* Surfing, bodyboarding, or skimboarding",
      "arabic": "* ركوب الأمواج أو ركوب الجسم أو التزلج على الماء",
      "image": "Image of Surfing at the beach"
    },
    {
      "english": "* Flying a kite",
      "arabic": "* الطائرة الورقية",
      "image": "Image of Flying a kite at the beach"
    },
    {
      "english": "* Beachcombing for seashells and other treasures",
      "arabic": "* تمشيط الشاطئ بحثًا عن الصدف وغيرها من الكنوز",
      "image": "Image of Beachcombing at the beach"
    },
    {
      "english": "* Relaxing with a good book",
      "arabic": "* الاسترخاء مع كتاب جيد",
      "image": "Image of Relaxing with a book at the beach"
    },
    {
      "english": "Going to the beach is a great way to create lasting memories with family and friends. So pack your beach bag and head to the coast for a fun-filled day!",
      "arabic": " يعد الذهاب إلى الشاطئ طريقة رائعة لخلق ذكريات دائمة مع العائلة والأصدقاء. لذا احزم حقيبة الشاطئ الخاصة بك وتوجه إلى الساحل لقضاء يوم مليء بالمرح!"
    }
  ]

  