[
    {
        "english": "What are human rights?",
        "arabic": "ما هي حقوق الإنسان؟"
    },
    {
        "english": "Human rights are the basic rights and freedoms that belong to every person in the world.",
        "arabic": "حقوق الإنسان هي الحقوق والحريات الأساسية التي تنتمي لكل شخص في العالم."
    },
    {
        "english": "Everyone has the right to life, liberty, and security.",
        "arabic": "لكل شخص الحق في الحياة والحرية والأمان."
    },
    {
        "english": "What is the Universal Declaration of Human Rights?",
        "arabic": "ما هو الإعلان العالمي لحقوق الإنسان؟"
    },
    {
        "english": "The Universal Declaration of Human Rights was adopted by the United Nations in 1948.",
        "arabic": "تم اعتماد الإعلان العالمي لحقوق الإنسان من قبل الأمم المتحدة في عام 1948."
    },
    {
        "english": "Freedom of speech is a fundamental human right.",
        "arabic": "حرية التعبير هي حق أساسي من حقوق الإنسان."
    },
    {
        "english": "No one shall be subjected to torture or to cruel, inhuman or degrading treatment.",
        "arabic": "لا يجوز إخضاع أحد للتعذيب أو المعاملة القاسية أو اللا إنسانية أو المهينة."
    },
    {
        "english": "Everyone has the right to a fair trial.",
        "arabic": "لكل شخص الحق في محاكمة عادلة."
    },
    {
        "english": "What are the rights of children?",
        "arabic": "ما هي حقوق الأطفال؟"
    },
    {
        "english": "Children have the right to education, protection, and care.",
        "arabic": "للأطفال الحق في التعليم والحماية والرعاية."
    },
    {
        "english": "Everyone has the right to freedom of thought, conscience, and religion.",
        "arabic": "لكل شخص الحق في حرية الفكر والضمير والدين."
    },
    {
        "english": "Discrimination on any grounds is a violation of human rights.",
        "arabic": "التمييز على أي أساس هو انتهاك لحقوق الإنسان."
    },
    {
        "english": "Everyone has the right to work and to just and favorable conditions of work.",
        "arabic": "لكل شخص الحق في العمل وفي ظروف عمل عادلة ومناسبة."
    },
    {
        "english": "What is the importance of human rights education?",
        "arabic": "ما هي أهمية تعليم حقوق الإنسان؟"
    },
    {
        "english": "Human rights education helps people understand their rights and the rights of others.",
        "arabic": "تعليم حقوق الإنسان يساعد الناس على فهم حقوقهم وحقوق الآخرين."
    },
    {
        "english": "Everyone has the right to seek asylum from persecution.",
        "arabic": "لكل شخص الحق في التماس اللجوء من الاضطهاد."
    },
    {
        "english": "What are civil and political rights?",
        "arabic": "ما هي الحقوق المدنية والسياسية؟"
    },
    {
        "english": "Civil and political rights include the right to vote, freedom of speech, and the right to a fair trial.",
        "arabic": "تشمل الحقوق المدنية والسياسية الحق في التصويت وحرية التعبير والحق في محاكمة عادلة."
    },
    {
        "english": "Economic, social, and cultural rights are also essential human rights.",
        "arabic": "الحقوق الاقتصادية والاجتماعية والثقافية هي أيضًا حقوق إنسانية أساسية."
    },
    {
        "english": "What is the role of international organizations in protecting human rights?",
        "arabic": "ما هو دور المنظمات الدولية في حماية حقوق الإنسان؟"
    },
    {
        "english": "International organizations like the United Nations work to promote and protect human rights globally.",
        "arabic": "تعمل المنظمات الدولية مثل الأمم المتحدة على تعزيز وحماية حقوق الإنسان عالميًا."
    },
    {
        "english": "Human rights violations should be reported and addressed.",
        "arabic": "يجب الإبلاغ عن انتهاكات حقوق الإنسان ومعالجتها."
    },
    {
        "english": "Everyone has the right to participate in the cultural life of the community.",
        "arabic": "لكل شخص الحق في المشاركة في الحياة الثقافية للمجتمع."
    },
    {
        "english": "What is the right to privacy?",
        "arabic": "ما هو الحق في الخصوصية؟"
    },
    {
        "english": "The right to privacy means that individuals have the right to keep their personal matters confidential.",
        "arabic": "الحق في الخصوصية يعني أن للأفراد الحق في الحفاظ على أمورهم الشخصية سرية."
    },
    {
        "english": "Everyone has the right to an adequate standard of living.",
        "arabic": "لكل شخص الحق في مستوى معيشي لائق."
    },
    {
        "english": "Human rights are universal and apply to everyone, everywhere.",
        "arabic": "حقوق الإنسان عالمية وتنطبق على الجميع في كل مكان."
    },
    {
        "english": "What is the right to education?",
        "arabic": "ما هو الحق في التعليم؟"
    },
    {
        "english": "The right to education means that everyone should have access to free and compulsory primary education.",
        "arabic": "الحق في التعليم يعني أن يكون لكل شخص الحق في الوصول إلى تعليم ابتدائي مجاني وإجباري."
    },
    {
        "english": "Everyone has the right to rest and leisure.",
        "arabic": "لكل شخص الحق في الراحة وأوقات الفراغ."
    },
    {
        "english": "What is the role of non-governmental organizations in promoting human rights?",
        "arabic": "ما هو دور المنظمات غير الحكومية في تعزيز حقوق الإنسان؟"
    },
    {
        "english": "Non-governmental organizations work to raise awareness and advocate for human rights.",
        "arabic": "تعمل المنظمات غير الحكومية على رفع الوعي والدفاع عن حقوق الإنسان."
    },
    {
        "english": "Everyone has the right to freedom of movement.",
        "arabic": "لكل شخص الحق في حرية التنقل."
    },
    {
        "english": "What is the right to freedom of assembly?",
        "arabic": "ما هو الحق في حرية التجمع؟"
    },
    {
        "english": "The right to freedom of assembly means that people can gather peacefully.",
        "arabic": "الحق في حرية التجمع يعني أن الناس يمكنهم التجمع بسلام."
    },
    {
        "english": "Everyone has the right to freedom of association.",
        "arabic": "لكل شخص الحق في حرية تكوين الجمعيات."
    },
    {
        "english": "What is the importance of human rights defenders?",
        "arabic": "ما هي أهمية المدافعين عن حقوق الإنسان؟"
    },
    {
        "english": "Human rights defenders work to protect and promote human rights.",
        "arabic": "يعمل المدافعون عن حقوق الإنسان على حماية وتعزيز حقوق الإنسان."
    },
    {
        "english": "Everyone has the right to own property.",
        "arabic": "لكل شخص الحق في امتلاك الممتلكات."
    },
    {
        "english": "What is the right to social security?",
        "arabic": "ما هو الحق في الضمان الاجتماعي؟"
    },
    {
        "english": "The right to social security ensures that individuals have access to support in times of need.",
        "arabic": "يضمن الحق في الضمان الاجتماعي أن يكون للأفراد الحق في الحصول على الدعم في أوقات الحاجة."
    },
    {
        "english": "Human rights include the right to participate in government and public affairs.",
        "arabic": "تشمل حقوق الإنسان الحق في المشاركة في الحكومة والشؤون العامة."
    },
    {
        "english": "What is the right to work?",
        "arabic": "ما هو الحق في العمل؟"
    },
    {
        "english": "The right to work means that everyone should have the opportunity to earn a living through work they freely choose.",
        "arabic": "الحق في العمل يعني أن يكون لكل شخص الحق في الحصول على فرصة لكسب العيش من خلال العمل الذي يختاره بحرية."
    },
    {
        "english": "Everyone has the right to freedom from slavery and forced labor.",
        "arabic": "لكل شخص الحق في التحرر من العبودية والعمل القسري."
    },
    {
        "english": "What is the right to health?",
        "arabic": "ما هو الحق في الصحة؟"
    },
    {
        "english": "The right to health means that everyone should have access to medical care and a healthy environment.",
        "arabic": "الحق في الصحة يعني أن يكون لكل شخص الحق في الوصول إلى الرعاية الطبية وبيئة صحية."
    },
    {
        "english": "Everyone has the right to freedom from arbitrary arrest and detention.",
        "arabic": "لكل شخص الحق في التحرر من الاعتقال والاحتجاز التعسفي."
    },
    {
        "english": "What is the right to asylum?",
        "arabic": "ما هو الحق في اللجوء؟"
    },
    {
        "english": "The right to asylum means that individuals have the right to seek protection in another country if they are persecuted.",
        "arabic": "الحق في اللجوء يعني أن يكون للأفراد الحق في التماس الحماية في بلد آخر إذا كانوا مضطهدين."
    }
]
