[
    {
      "english": "International trade is the exchange of goods and services between countries.",
      "arabic": "التجارة الدولية هي تبادل السلع والخدمات بين الدول."
    },
    {
      "english": "It plays a vital role in the global economy by promoting economic growth and development.",
      "arabic": "تلعب دورًا حيويًا في الاقتصاد العالمي من خلال تعزيز النمو الاقتصادي والتنمية."
    },
    {
      "english": "There are many different types of international trade, such as exports, imports, and foreign direct investment.",
      "arabic": "هناك العديد من أنواع التجارة الدولية المختلفة ، مثل الصادرات والواردات والاستثمار الأجنبي المباشر."
    },
    {
      "english": "Exports are goods and services produced in one country and sold to another country.",
      "arabic": "الصادرات هي سلع وخدمات تنتج في دولة وتباع لدولة أخرى."
    },
    {
      "english": "Imports are goods and services purchased from another country.",
      "arabic": "الواردات هي سلع وخدمات يتم شراؤها من دولة أخرى."
    },
    {
      "english": "Foreign direct investment (FDI) is when a company invests in a business in another country.",
      "arabic": "الاستثمار الأجنبي المباشر (FDI) هو عندما تستثمر شركة في عمل تجاري في دولة أخرى."
    },
    {
      "english": "International trade agreements can help to reduce trade barriers and promote economic cooperation.",
      "arabic": "يمكن أن تساعد اتفاقيات التجارة الدولية على تقليل الحواجز التجارية وتعزيز التعاون الاقتصادي."
    },
    {
      "english": "Some of the challenges of international trade include trade barriers, currency fluctuations, and political instability.",
      "arabic": "تشمل بعض تحديات التجارة الدولية الحواجز التجارية وتقلبات العملة وعدم الاستقرار السياسي."
    },
    {
      "english": "Understanding international trade is important for businesses, governments, and individuals alike.",
      "arabic": "فهم التجارة الدولية مهم للشركات والحكومات والأفراد على حد سواء."
    },
    {
      "english": "Are you interested in learning more about a specific aspect of international trade?",
      "arabic": "هل أنت مهتم بمعرفة المزيد عن جانب معين من التجارة الدولية؟"
    },
    {
      "english": "International trade can create jobs and stimulate economic growth in both exporting and importing countries.",
      "arabic": "يمكن للتجارة الدولية خلق فرص عمل وتحفيز النمو الاقتصادي في كل من الدول المصدرة والمستوردة."
    },
    {
      "english": "The free flow of goods and services can lead to increased competition and lower prices for consumers.",
      "arabic": "يمكن أن يؤدي حرية تدفق السلع والخدمات إلى زيادة المنافسة وانخفاض الأسعار للمستهلكين."
    },
    {
      "english": "However, international trade can also lead to job losses in certain sectors and environmental concerns.",
      "arabic": "ومع ذلك ، يمكن أن تؤدي التجارة الدولية أيضًا إلى فقدان وظائف في قطاعات معينة ومخاوف بيئية."
    },
    {
      "english": "It's important to consider both the benefits and challenges of international trade when making policy decisions.",
      "arabic": "من المهم مراعاة كل من فوائد وتحديات التجارة الدولية عند اتخاذ قرارات سياسة."
    },
    {
      "english": "International trade organizations, such as the World Trade Organization (WTO), play a role in regulating international trade.",
      "arabic": "تلعب المنظمات التجارية الدولية ، مثل منظمة التجارة العالمية (WTO) ، دورًا في تنظيم التجارة الدولية."
    }
  ]

  