[
    {
      "english": "Job interviews are conversations between a potential employer and a candidate to assess suitability for a position.",
      "arabic": "مقابلة العمل هي محادثة بين صاحب عمل محتمل ومترشح لتقييم مدى ملاءمته للوظيفة."
    },
    {
      "english": "Preparation is key to a successful interview. Research the company and the position beforehand.",
      "arabic": "الاستعداد هو مفتاح لإجراء مقابلة ناجحة. ابحث عن الشركة والوظيفة مسبقًا."
    },
    {
      "english": "Common interview questions can include your skills, experience, and motivation for the job.",
      "arabic": "يمكن أن تشمل أسئلة المقابلة الشائعة مهاراتك وخبراتك ودوافعك للوظيفة."
    },
      {
      "english": "Be prepared to answer behavioral interview questions that focus on past experiences and problem-solving skills.",
      "arabic": "كن مستعدًا للإجابة على أسئلة مقابلة السلوك التي تركز على الخبرات السابقة ومهارات حل المشكلات."
    },
    {
      "english": "It's also important to have questions ready for the interviewer about the company and the role.",
      "arabic": "من المهم أيضًا أن يكون لديك أسئلة جاهزة للمقابلة حول الشركة والدور."
    },
    {
      "english": "Make a good first impression by dressing professionally and arriving on time.",
      "arabic": "اصنع انطباعًا أوليًا جيدًا من خلال ارتداء ملابس احترافية والوصول في الموعد المحدد."
    },
    {
      "english": "Be confident, articulate, and enthusiastic during the interview.",
      "arabic": "كن متأكدا من نفسك ، وبليغا ، ومتحمسا خلال المقابلة."
    },
    {
      "english": "Following up with a thank-you email after the interview shows your continued interest in the position.",
      "arabic": "متابعة البريد الإلكتروني الموجه إليهم بعد المقابلة يظهر اهتمامك المستمر بالوظيفة."
    },
    {
      "english": "Here are some additional interview tips:",
      "arabic": "فيما يلي بعض نصائح المقابلة الإضافية:"
    },
    {
      "english": "* Practice your answers to common interview questions beforehand.",
      "arabic": "* تدرب على إجاباتك على أسئلة المقابلة الشائعة مسبقًا."
    },
    {
      "english": "* Be positive and highlight your strengths and accomplishments.",
      "arabic": "* كن إيجابيًا واكشف عن نقاط قوتك وإنجازاتك."
    },
    {
      "english": "* Ask thoughtful questions that demonstrate your interest in the company and the role.",
      "arabic": "* اطرح أسئلة مدروسة تظهر اهتمامك بالشركة والدور."
    },
    {
      "english": "* Maintain good eye contact and body language throughout the interview.",
      "arabic": "* حافظ على اتصال جيد بالعين ولغة جسد جيدة طوال المقابلة."
    },
    {
      "english": "Remember, the interview is a two-way street. You're also evaluating the company to see if it's a good fit for you.",
      "arabic": "تذكر أن المقابلة هي طريق ذو اتجاهين. أنت تقيم الشركة أيضًا لمعرفة ما إذا كانت مناسبة لك."
    },
    {
      "english": "Would you like to see some examples of common interview questions and answers?",
      "arabic": "هل ترغب في رؤية بعض الأمثلة على أسئلة المقابلة الشائعة والإجابات؟"
    }
  ]

  