[
    {
      "english": "Law is a system of rules that are enforced by social institutions to govern behavior.",
      "arabic": "القانون هو نظام من القواعد التي تفرضها المؤسسات الاجتماعية لحكم السلوك."
    },
    {
      "english": "Legal studies is the academic discipline that examines law and its applications.",
      "arabic": "الدراسات القانونية هي التخصص الأكاديمي الذي يفحص القانون وتطبيقاته."
    },
    {
      "english": "Law plays a crucial role in maintaining order, justice, and a functioning society.",
      "arabic": "يلعب القانون دورًا مهمًا في الحفاظ على النظام والعدالة والمجتمع الفاعل."
    },
    {
      "english": "There are many different areas of law, such as criminal law, civil law, and international law.",
      "arabic": "هناك العديد من المجالات القانونية المختلفة ، مثل القانون الجنائي والقانون المدني والقانون الدولي."
    },
    {
      "english": "Criminal law deals with crimes and the punishment of offenders.",
      "arabic": "يعالج القانون الجنائي الجرائم ومعاقبة الجناة."
    },
    {
      "english": "Civil law concerns disputes between individuals or organizations.",
      "arabic": "يعني القانون المدني بالنزاعات بين الأفراد أو المنظمات."
    },
    {
      "english": "International law governs relations between countries.",
      "arabic": "يحكم القانون الدولي العلاقات بين الدول."
    },
    {
      "english": "The legal system can be complex, with different courts and legal procedures for different types of cases.",
      "arabic": "يمكن أن يكون النظام القانوني معقدًا ، حيث توجد محاكم وإجراءات قانونية مختلفة لأنواع مختلفة من القضايا."
    },
    {
      "english": "Lawyers are legal professionals who advise clients on their legal rights and represent them in court.",
      "arabic": "المحامون هم مهنيون قانونيون ينصحون العملاء بشأن حقوقهم القانونية ويمثلونهم في المحكمة."
    },
    {
      "english": "Are you interested in a specific area of law?",
      "arabic": "هل أنت مهتم بمجال معين من القانون؟"
    },
    {
      "english": "Understanding the law can help you protect your rights and navigate legal issues in your everyday life.",
      "arabic": "يمكن أن يساعدك فهم القانون على حماية حقوقك والتعامل مع القضايا القانونية في حياتك اليومية."
    },
    {
      "english": "The law is constantly evolving to address new challenges and social issues.",
      "arabic": "يتطور القانون باستمرار لمواجهة التحديات والقضايا الاجتماعية الجديدة."
    },
    {
      "english": "There are many famous legal cases that have shaped the law as we know it today.",
      "arabic": "هناك العديد من القضايا القانونية الشهيرة التي شكلت القانون كما نعرفه اليوم."
    },
    {
      "english": "Legal studies can be a challenging but rewarding field of study.",
      "arabic": "يمكن أن تكون الدراسات القانونية مجالًا دراسيًا صعبًا ولكنه مجزٍ."
    },
    {
      "english": "Law schools train future lawyers and legal professionals.",
      "arabic": "تدرب كليات الحقوق المحامين ومحترفي القانون المستقبليين."
    }
  ]
 
  