[
    {
      "english": "Mental health is just as important as physical health.",
      "arabic": "الصحة النفسية مهمة مثل الصحة البدنية."
    },
    {
      "english": "It's okay to not be okay. Talking about your mental health is important.",
      "arabic": "لا بأس في أن لا تكون بخير. التحدث عن صحتك النفسية أمر مهم."
    },
    {
      "english": "There are many resources available to help people with mental health challenges.",
      "arabic": "هناك العديد من الموارد المتاحة لمساعدة الأشخاص الذين يعانون من تحديات الصحة النفسية."
    },
    {
      "english": "Taking care of your mental health is an ongoing process.",
      "arabic": "العناية بصحتك النفسية عملية مستمرة."
    },
    {
      "english": "There are many different types of mental health conditions.",
      "arabic": "هناك العديد من أنواع الاضطرابات النفسية المختلفة."
    },
    {
      "english": "If you're struggling, please reach out to a mental health professional.",
      "arabic": "إذا كنت تعاني ، يرجى التواصل مع أخصائي صحة نفسية."
    },
    {
      "english": "There is no shame in seeking help for your mental health.",
      "arabic": "لا يوجد عيب في طلب المساعدة لصحتك النفسية."
    },
    {
      "english": "Therapy can be a very effective way to improve your mental health.",
      "arabic": "يمكن أن يكون العلاج النفسي طريقة فعالة للغاية لتحسين صحتك النفسية."
    },
    {
      "english": "There are also many self-care practices that can help you manage your mental health.",
      "arabic": "هناك أيضًا العديد من ممارسات العناية الذاتية التي يمكن أن تساعدك على إدارة صحتك النفسية."
    },
    {
      "english": "Examples of self-care practices include exercise, healthy eating, getting enough sleep, and relaxation techniques.",
      "arabic": "تشمل أمثلة ممارسات العناية الذاتية ممارسة الرياضة ، والتغذية الصحية ، والحصول على قسط كافٍ من النوم ، وتقنيات الاسترخاء."
    },
    {
      "english": "It's important to find healthy coping mechanisms for stress and anxiety.",
      "arabic": "من المهم العثور على آليات مواجهة صحية للضغط والقلق."
    },
    {
      "english": "Talking to a friend or family member about how you're feeling can also be helpful.",
      "arabic": "يمكن أن يكون الحديث إلى صديق أو فرد من العائلة عن شعورك مفيدًا أيضًا."
    },
    {
      "english": "There are many mental health hotlines available 24/7 if you need immediate support.",
      "arabic": "هناك العديد من خطوط مساعدة الصحة النفسية المتاحة على مدار الساعة طوال أيام الأسبوع إذا كنت بحاجة إلى دعم فوري."
    },
    {
      "english": "Here are some resources that can help: [list of resources]",  
      "arabic": "فيما يلي بعض الموارد التي يمكن أن تساعد: [قائمة بالموارد]"
    },
    {
      "english": "You are not alone. Many people struggle with mental health challenges.",
      "arabic": "أنت لست وحدك. يعاني الكثير من الناس من تحديات الصحة النفسية."
    },
    {
      "english": "There is hope for recovery. With treatment and support, you can feel better.",
      "arabic": "هناك أمل في التعافي. مع العلاج والدعم ، يمكنك أن تشعر بتحسن."
    }
  ]
  