[
    {
      "english": "The ocean is a vast and mysterious place.",
      "arabic": "المحيط مكان شاسع وغامض."
    },
    {
      "english": "Oceanography is the study of the ocean and its ecosystems.",
      "arabic": "علم المحيطات هو دراسة المحيط ونظامه البيئي."
    },
    {
      "english": "Oceanographers study everything from the ocean floor to the surface waters.",
      "arabic": "يدرس علماء المحيطات كل شيء بدءًا من قاع المحيط إلى المياه السطحية."
    },
    {
      "english": "They are interested in the physical, chemical, and biological properties of the ocean.",
      "arabic": "يهتمون بالخصائص الفيزيائية والكيميائية والبيولوجية للمحيط."
    },
    {
      "english": "Ocean currents, waves, tides, and marine life are all part of oceanography.",
      "arabic": "التيارات المحيطية والأمواج والمد والجزر والحياة البحرية كلها جزء من علم المحيطات."
    },
    {
      "english": "The ocean plays a vital role in regulating the Earth's climate.",
      "arabic": "يلعب المحيط دورًا حيويًا في تنظيم مناخ الأرض."
    },
    {
      "english": "Oceanographers are working to understand how climate change is affecting the ocean.",
      "arabic": "يعمل علماء المحيطات على فهم كيف يؤثر تغير المناخ على المحيط."
    },
    {
      "english": "They are also developing ways to protect the ocean and its resources.",
      "arabic": "كما أنهم يطورون طرقًا لحماية المحيط وموارده."
    },
    {
      "english": "A healthy ocean is essential for a healthy planet.",
      "arabic": "محيط صحي ضروري لكوكب صحي."
    },
    {
      "english": "I'm interested in learning more about marine biology.",
      "arabic": "أنا مهتم بمعرفة المزيد عن علم الأحياء البحرية."
    },
    {
      "english": "Have you seen any documentaries about the ocean lately?",
      "arabic": "هل شاهدت أي أفلام وثائقية عن المحيط مؤخرًا؟"
    },
    {
      "english": "The ocean depths are still largely unexplored.",
      "arabic": "أعماق المحيطات لا تزال غير مستكشفة إلى حد كبير."
    },
    {
      "english": "Imagine all the amazing creatures that live down there!",
      "arabic": "تخيل كل تلك المخلوقات المذهلة التي تعيش هناك!"
    },
    {
      "english": "Oceanography is a fascinating field with a lot to discover.",
      "arabic": "علم المحيطات مجال رائع مع الكثير لاكتشافه."
    },
    {
      "english": "What aspects of oceanography are you most curious about?",
      "arabic": "ما جوانب علم المحيطات التي تثير فضولك أكثر؟"
    },
    {
      "english": "Protecting the ocean is a responsibility for all of us.",
      "arabic": "حماية المحيط مسؤولية تقع على عاتق جميعنا."
    }
  ]
