[
    {
      "english": "Space exploration is a fascinating field.",
      "arabic": "استكشاف الفضاء مجال رائع."
    },
    {
      "english": "I'm curious about what lies beyond our planet.",
      "arabic": "أنا متشوق لمعرفة ما وراء كوكبنا."
    },
    {
      "english": "Do you think there is life on other planets?",
      "arabic": "هل تعتقد أن هناك حياة على كواكب أخرى؟"
    },
    {
      "english": "We have sent probes to explore other planets and moons.",
      "arabic": "لقد أرسلنا مجسات لاستكشاف الكواكب والأقمار الأخرى."
    },
    {
      "english": "The recent discovery of exoplanets is exciting!",
      "arabic": "اكتشاف الكواكب الخارجية الأخير مثير!"
    },
      {
      "english": "The James Webb Space Telescope is helping us learn more about the universe.",
      "arabic": "يساعدنا مقراب جيمس ويب الفضائي على معرفة المزيد عن الكون."
    },
    {
      "english": "I'm following the latest news about the Mars missions.",
      "arabic": "أتابع آخر الأخبار حول بعثات المريخ."
    },
    {
      "english": "Space travel is becoming more and more realistic.",
      "arabic": "يصبح السفر إلى الفضاء أكثر واقعية."
    },
    {
      "english": "Who would you like to take with you on a trip to space?",
      "arabic": "من تحب أن تأخذه معك في رحلة إلى الفضاء؟"
    },
    {
      "english": "The possibility of colonizing other planets is intriguing.",
      "arabic": "إمكانية استعمار كواكب أخرى مثيرة للاهتمام."
    },
    {
      "english": "Space exploration is important for our future.",
      "arabic": "استكشاف الفضاء مهم لمستقبلنا."
    },
    {
      "english": "It helps us understand our place in the universe.",
      "arabic": "يساعدنا على فهم مكاننا في الكون."
    },
    {
      "english": "It also has the potential to solve problems on Earth.",
      "arabic": "كما أن لديها القدرة على حل المشاكل على الأرض."
    },
    {
      "english": "What are you most interested in learning about space?",
      "arabic": "ما الذي يثير اهتمامك أكثر لتعلمه عن الفضاء؟"
    },
    {
      "english": "There's so much we still don't know about the universe!",
      "arabic": "هناك الكثير مما لا نعرفه بعد عن الكون!"
    },
    {
      "english": "I hope we can continue to explore space for many years to come.",
      "arabic": "آمل أن نتمكن من مواصلة استكشاف الفضاء لسنوات عديدة قادمة."
    }
  ]

  