[
    {
        "english": "What is renewable energy?",
        "arabic": "ما هي الطاقة المتجددة؟"
    },
    {
        "english": "Solar power is a popular form of renewable energy.",
        "arabic": "الطاقة الشمسية هي شكل شائع من أشكال الطاقة المتجددة."
    },
    {
        "english": "Wind turbines generate electricity from wind energy.",
        "arabic": "تولد توربينات الرياح الكهرباء من طاقة الرياح."
    },
    {
        "english": "Hydropower uses water to generate electricity.",
        "arabic": "تستخدم الطاقة الكهرومائية الماء لتوليد الكهرباء."
    },
    {
        "english": "What are the benefits of renewable energy?",
        "arabic": "ما هي فوائد الطاقة المتجددة؟"
    },
    {
        "english": "Renewable energy sources are environmentally friendly.",
        "arabic": "مصادر الطاقة المتجددة صديقة للبيئة."
    },
    {
        "english": "How can we reduce our carbon footprint?",
        "arabic": "كيف يمكننا تقليل بصمتنا الكربونية؟"
    },
    {
        "english": "What is the importance of sustainability?",
        "arabic": "ما هي أهمية الاستدامة؟"
    },
    {
        "english": "Using renewable energy can help combat climate change.",
        "arabic": "استخدام الطاقة المتجددة يمكن أن يساعد في مكافحة تغير المناخ."
    },
    {
        "english": "Electric vehicles produce fewer emissions than traditional cars.",
        "arabic": "السيارات الكهربائية تنتج انبعاثات أقل من السيارات التقليدية."
    },
    {
        "english": "How do solar panels work?",
        "arabic": "كيف تعمل الألواح الشمسية؟"
    },
    {
        "english": "Geothermal energy comes from the heat inside the Earth.",
        "arabic": "تأتي الطاقة الحرارية الأرضية من الحرارة داخل الأرض."
    },
    {
        "english": "Sustainable practices can lead to long-term economic benefits.",
        "arabic": "يمكن أن تؤدي الممارسات المستدامة إلى فوائد اقتصادية طويلة الأجل."
    },
    {
        "english": "What are the challenges of implementing renewable energy?",
        "arabic": "ما هي تحديات تنفيذ الطاقة المتجددة؟"
    },
    {
        "english": "Biodiversity is crucial for a healthy ecosystem.",
        "arabic": "التنوع البيولوجي ضروري لنظام بيئي صحي."
    },
    {
        "english": "How can individuals contribute to sustainability?",
        "arabic": "كيف يمكن للأفراد المساهمة في الاستدامة؟"
    },
    {
        "english": "What is the role of government in promoting renewable energy?",
        "arabic": "ما هو دور الحكومة في تعزيز الطاقة المتجددة؟"
    },
    {
        "english": "Green buildings use resources more efficiently.",
        "arabic": "تستخدم المباني الخضراء الموارد بشكل أكثر كفاءة."
    },
    {
        "english": "Recycling helps reduce waste and conserve resources.",
        "arabic": "إعادة التدوير تساعد على تقليل النفايات والحفاظ على الموارد."
    },
    {
        "english": "What are the different types of renewable energy?",
        "arabic": "ما هي أنواع الطاقة المتجددة المختلفة؟"
    },
    {
        "english": "What is the impact of fossil fuels on the environment?",
        "arabic": "ما هو تأثير الوقود الأحفوري على البيئة؟"
    },
    {
        "english": "Community involvement is key to successful sustainability initiatives.",
        "arabic": "مشاركة المجتمع هي المفتاح لمبادرات الاستدامة الناجحة."
    },
    {
        "english": "What is the future of renewable energy technology?",
        "arabic": "ما هو مستقبل تكنولوجيا الطاقة المتجددة؟"
    },
    {
        "english": "Renewable energy can create new job opportunities.",
        "arabic": "يمكن للطاقة المتجددة أن تخلق فرص عمل جديدة."
    },
    {
        "english": "Energy efficiency is an important aspect of sustainability.",
        "arabic": "كفاءة الطاقة هي جانب مهم من جوانب الاستدامة."
    },
    {
        "english": "How does renewable energy impact the economy?",
        "arabic": "كيف تؤثر الطاقة المتجددة على الاقتصاد؟"
    },
    {
        "english": "Sustainable agriculture practices can help preserve the environment.",
        "arabic": "الممارسات الزراعية المستدامة يمكن أن تساعد في الحفاظ على البيئة."
    },
    {
        "english": "What are the barriers to adopting renewable energy?",
        "arabic": "ما هي العوائق أمام تبني الطاقة المتجددة؟"
    },
    {
        "english": "Water conservation is a key component of sustainability.",
        "arabic": "الحفاظ على المياه هو عنصر رئيسي في الاستدامة."
    },
    {
        "english": "What is the role of education in promoting sustainability?",
        "arabic": "ما هو دور التعليم في تعزيز الاستدامة؟"
    },
    {
        "english": "Renewable energy projects can be funded through various means.",
        "arabic": "يمكن تمويل مشاريع الطاقة المتجددة بوسائل مختلفة."
    },
    {
        "english": "What is the significance of the Paris Agreement?",
        "arabic": "ما هي أهمية اتفاقية باريس؟"
    },
    {
        "english": "Sustainable tourism focuses on minimizing environmental impact.",
        "arabic": "يركز السياحة المستدامة على تقليل التأثير البيئي."
    },
    {
        "english": "What are the health benefits of clean energy?",
        "arabic": "ما هي الفوائد الصحية للطاقة النظيفة؟"
    },
    {
        "english": "Circular economy aims to eliminate waste and continually use resources.",
        "arabic": "يهدف الاقتصاد الدائري إلى القضاء على النفايات واستخدام الموارد باستمرار."
    },
    {
        "english": "What policies can support renewable energy growth?",
        "arabic": "ما هي السياسات التي يمكن أن تدعم نمو الطاقة المتجددة؟"
    },
    {
        "english": "Sustainable transportation options include biking and public transit.",
        "arabic": "تشمل خيارات النقل المستدامة ركوب الدراجات ووسائل النقل العامة."
    },
    {
        "english": "What is the impact of plastic pollution on marine life?",
        "arabic": "ما هو تأثير التلوث البلاستيكي على الحياة البحرية؟"
    },
    {
        "english": "How can businesses adopt sustainable practices?",
        "arabic": "كيف يمكن للشركات تبني ممارسات مستدامة؟"
    },
    {
        "english": "Renewable energy can reduce dependency on fossil fuels.",
        "arabic": "يمكن للطاقة المتجددة تقليل الاعتماد على الوقود الأحفوري."
    },
    {
        "english": "What are the advantages of wind energy?",
        "arabic": "ما هي مميزات طاقة الرياح؟"
    },
    {
        "english": "What are the challenges of solar energy?",
        "arabic": "ما هي تحديات الطاقة الشمسية؟"
    },
    {
        "english": "What is the potential of tidal energy?",
        "arabic": "ما هو إمكانيات طاقة المد والجزر؟"
    },
    {
        "english": "How does renewable energy contribute to energy security?",
        "arabic": "كيف تساهم الطاقة المتجددة في أمن الطاقة؟"
    },
    {
        "english": "What is the role of innovation in sustainability?",
        "arabic": "ما هو دور الابتكار في الاستدامة؟"
    },
    {
        "english": "What are green jobs and why are they important?",
        "arabic": "ما هي الوظائف الخضراء ولماذا هي مهمة؟"
    },
    {
        "english": "How can cities become more sustainable?",
        "arabic": "كيف يمكن للمدن أن تصبح أكثر استدامة؟"
    },
    {
        "english": "What are the benefits of energy storage systems?",
        "arabic": "ما هي فوائد أنظمة تخزين الطاقة؟"
    },
    {
        "english": "What are the environmental impacts of deforestation?",
        "arabic": "ما هي الآثار البيئية لإزالة الغابات؟"
    }
]
