[
    {
        "english": "What courses are available in technical education?",
        "arabic": "ما هي الدورات المتاحة في التعليم التقني؟"
    },
    {
        "english": "Vocational training can lead to many career opportunities.",
        "arabic": "يمكن أن يؤدي التدريب المهني إلى العديد من فرص العمل."
    },
    {
        "english": "What are the benefits of a vocational education?",
        "arabic": "ما هي فوائد التعليم المهني؟"
    },
    {
        "english": "Technical education focuses on practical skills.",
        "arabic": "يركز التعليم التقني على المهارات العملية."
    },
    {
        "english": "How long is the vocational training program?",
        "arabic": "ما هي مدة برنامج التدريب المهني؟"
    },
    {
        "english": "Students can earn certifications in various trades.",
        "arabic": "يمكن للطلاب الحصول على شهادات في مختلف الحرف."
    },
    {
        "english": "Hands-on experience is a key component of technical education.",
        "arabic": "التجربة العملية هي مكون رئيسي في التعليم التقني."
    },
    {
        "english": "What job opportunities are available after completing this course?",
        "arabic": "ما هي فرص العمل المتاحة بعد إكمال هذه الدورة؟"
    },
    {
        "english": "Technical schools often partner with local businesses.",
        "arabic": "غالباً ما تتعاون المدارس التقنية مع الشركات المحلية."
    },
    {
        "english": "We offer courses in automotive technology.",
        "arabic": "نقدم دورات في تكنولوجيا السيارات."
    },
    {
        "english": "Can you tell me more about the welding program?",
        "arabic": "هل يمكنك إخباري المزيد عن برنامج اللحام؟"
    },
    {
        "english": "Vocational education helps students develop job-specific skills.",
        "arabic": "يساعد التعليم المهني الطلاب على تطوير مهارات محددة للوظائف."
    },
    {
        "english": "What kind of equipment will we use in this course?",
        "arabic": "ما نوع المعدات التي سنستخدمها في هذه الدورة؟"
    },
    {
        "english": "The technical education program includes an internship.",
        "arabic": "يتضمن برنامج التعليم التقني فترة تدريب."
    },
    {
        "english": "Students learn to operate industrial machinery.",
        "arabic": "يتعلم الطلاب تشغيل الآلات الصناعية."
    },
    {
        "english": "We offer online and in-person technical training.",
        "arabic": "نقدم تدريباً تقنياً عبر الإنترنت وفي الحضور الشخصي."
    },
    {
        "english": "What are the prerequisites for enrolling in this course?",
        "arabic": "ما هي المتطلبات الأساسية للتسجيل في هذه الدورة؟"
    },
    {
        "english": "Technical education can improve problem-solving skills.",
        "arabic": "يمكن أن يحسن التعليم التقني مهارات حل المشكلات."
    },
    {
        "english": "Do you offer financial aid for vocational students?",
        "arabic": "هل تقدمون مساعدات مالية للطلاب المهنيين؟"
    },
    {
        "english": "The curriculum includes both theory and practice.",
        "arabic": "تشمل المناهج الدراسية النظرية والتطبيق."
    },
    {
        "english": "What kind of projects will we work on in this course?",
        "arabic": "ما نوع المشاريع التي سنعمل عليها في هذه الدورة؟"
    },
    {
        "english": "Vocational training programs can be completed quickly.",
        "arabic": "يمكن إكمال برامج التدريب المهني بسرعة."
    },
    {
        "english": "Students receive hands-on training from experienced instructors.",
        "arabic": "يتلقى الطلاب تدريباً عملياً من مدربين ذوي خبرة."
    },
    {
        "english": "We have state-of-the-art facilities for technical education.",
        "arabic": "لدينا مرافق حديثة للتعليم التقني."
    },
    {
        "english": "What certifications can I earn through this program?",
        "arabic": "ما هي الشهادات التي يمكنني الحصول عليها من خلال هذا البرنامج؟"
    },
    {
        "english": "Technical education prepares students for the workforce.",
        "arabic": "يعد التعليم التقني الطلاب لسوق العمل."
    },
    {
        "english": "We offer job placement assistance for graduates.",
        "arabic": "نقدم مساعدة في التوظيف للخريجين."
    },
    {
        "english": "What is the admission process for this vocational school?",
        "arabic": "ما هي عملية القبول في هذه المدرسة المهنية؟"
    },
    {
        "english": "Technical education includes training in computer-aided design (CAD).",
        "arabic": "يشمل التعليم التقني التدريب على التصميم بمساعدة الكمبيوتر (CAD)."
    },
    {
        "english": "We focus on industry-relevant skills and knowledge.",
        "arabic": "نركز على المهارات والمعرفة ذات الصلة بالصناعة."
    },
    {
        "english": "What is the average salary for jobs in this field?",
        "arabic": "ما هو متوسط الراتب للوظائف في هذا المجال؟"
    },
    {
        "english": "Our technical programs are accredited by industry standards.",
        "arabic": "برامجنا التقنية معتمدة من معايير الصناعة."
    },
    {
        "english": "Students can participate in apprenticeships with local companies.",
        "arabic": "يمكن للطلاب المشاركة في التدريب المهني مع الشركات المحلية."
    },
    {
        "english": "How can I apply for the vocational training program?",
        "arabic": "كيف يمكنني التقديم لبرنامج التدريب المهني؟"
    },
    {
        "english": "We provide career counseling for all students.",
        "arabic": "نوفر استشارات مهنية لجميع الطلاب."
    },
    {
        "english": "What kind of support services are available for students?",
        "arabic": "ما هي خدمات الدعم المتاحة للطلاب؟"
    },
    {
        "english": "Technical education can lead to high-demand jobs.",
        "arabic": "يمكن أن يؤدي التعليم التقني إلى وظائف عالية الطلب."
    },
    {
        "english": "Students learn to troubleshoot and repair equipment.",
        "arabic": "يتعلم الطلاب استكشاف الأخطاء وإصلاح المعدات."
    },
    {
        "english": "We have partnerships with industry leaders for student internships.",
        "arabic": "لدينا شراكات مع قادة الصناعة لتوفير فرص التدريب للطلاب."
    },
    {
        "english": "What are the career prospects after completing this technical course?",
        "arabic": "ما هي آفاق العمل بعد إكمال هذه الدورة التقنية؟"
    },
    {
        "english": "We offer flexible scheduling for working students.",
        "arabic": "نقدم جداول مرنة للطلاب العاملين."
    },
    {
        "english": "What kind of hands-on projects will we do?",
        "arabic": "ما نوع المشاريع العملية التي سنقوم بها؟"
    },
    {
        "english": "Our vocational programs are designed to meet industry needs.",
        "arabic": "تم تصميم برامجنا المهنية لتلبية احتياجات الصناعة."
    },
    {
        "english": "Can I tour the technical facilities before enrolling?",
        "arabic": "هل يمكنني زيارة المرافق التقنية قبل التسجيل؟"
    },
    {
        "english": "What skills are most in demand in the technical field?",
        "arabic": "ما هي المهارات الأكثر طلباً في المجال التقني؟"
    },
    {
        "english": "We offer training in renewable energy technologies.",
        "arabic": "نقدم تدريباً في تقنيات الطاقة المتجددة."
    },
    {
        "english": "Technical education can enhance problem-solving abilities.",
        "arabic": "يمكن أن يعزز التعليم التقني قدرات حل المشكلات."
    },
    {
        "english": "What are the requirements for graduation?",
        "arabic": "ما هي متطلبات التخرج؟"
    },
    {
        "english": "Our instructors are industry professionals.",
        "arabic": "مدربونا هم من المحترفين في الصناعة."
    }
]
