[
    {
      "english": "Traditional industries are the backbone of many economies.",
      "arabic": "الصناعات التقليدية هي العمود الفقري للعديد من الاقتصادات."
    },
    {
      "english": "Examples include agriculture, manufacturing, and construction.",
      "arabic": "تشمل الأمثلة الزراعة والتصنيع والبناء."
    },
    {
      "english": "These industries have been around for centuries and continue to be essential.",
      "arabic": "هذه الصناعات موجودة منذ قرون ولا تزال ضرورية."
    },
    {
      "english": "The agricultural industry provides food for a growing population.",
      "arabic": "توفر الصناعة الزراعية الغذاء لسكان العالم المتزايد."
    },
    {
      "english": "Manufacturing creates a wide range of products we use every day.",
      "arabic": "يخلق التصنيع مجموعة واسعة من المنتجات التي نستخدمها كل يوم."
    },
    {
      "english": "The construction industry builds the infrastructure we rely on.",
      "arabic": "تصنع صناعة البناء البنية التحتية التي نعتمد عليها."
    },
    {
      "english": "While technology is changing some traditional industries, they are also adapting.",
      "arabic": "بينما تغير التكنولوجيا بعض الصناعات التقليدية ، فإنها تتكيف أيضًا."
    },
    {
      "english": "Precision agriculture, automation in manufacturing, and sustainable construction are some examples.",
      "arabic": "الزراعة الدقيقة ، والأتمتة في التصنيع ، والبناء المستدام هي بعض الأمثلة."
    },
    {
      "english": "Traditional industries will continue to play an important role in the future.",
      "arabic": "ستستمر الصناعات التقليدية في لعب دور مهم في المستقبل."
    },
    {
      "english": "They provide jobs, support economic growth, and contribute to our overall well-being.",
      "arabic": "توفر فرص عمل وتدعم النمو الاقتصادي وتساهم في صحتنا العامة."
    },
    {
      "english": "However, it's important to balance tradition with innovation to ensure their sustainability.",
      "arabic": "ومع ذلك ، من المهم تحقيق التوازن بين التقاليد والابتكار لضمان استدامتها."
    },
    {
      "english": "What traditional industry are you most interested in?",
      "arabic": "بأي صناعة تقليدية أنت أكثر اهتماما؟"
    },
    {
      "english": "These industries have a rich history and have shaped our world in many ways.",
      "arabic": "هذه الصناعات لها تاريخ عريق وشكلت عالمنا بطرق عديدة."
    },
    {
      "english": "There are many skilled workers who dedicate their careers to these industries.",
      "arabic": "هناك العديد من العمال المهرة الذين يكرسون حياتهم المهنية لهذه الصناعات."
    },
    {
      "english": "Supporting traditional industries helps preserve cultural heritage and traditions.",
      "arabic": "يساهم دعم الصناعات التقليدية في الحفاظ على التراث الثقافي والتقاليد."
    }  
  ]
