[
    {
        "english": "What are the common diseases in pets?",
        "arabic": "ما هي الأمراض الشائعة عند الحيوانات الأليفة؟"
    },
    {
        "english": "Regular check-ups are essential for your pet's health.",
        "arabic": "الفحوصات الدورية ضرورية لصحة حيوانك الأليف."
    },
    {
        "english": "How often should I bring my pet to the vet?",
        "arabic": "كم مرة يجب أن أحضر حيواني الأليف إلى الطبيب البيطري؟"
    },
    {
        "english": "Vaccinations are important to prevent diseases.",
        "arabic": "التطعيمات مهمة للوقاية من الأمراض."
    },
    {
        "english": "What should I feed my pet for a balanced diet?",
        "arabic": "ماذا يجب أن أطعم حيواني الأليف للحصول على نظام غذائي متوازن؟"
    },
    {
        "english": "My pet is scratching a lot, what should I do?",
        "arabic": "حيواني الأليف يخدش كثيرًا، ماذا يجب أن أفعل؟"
    },
    {
        "english": "How do I know if my pet is in pain?",
        "arabic": "كيف أعرف إذا كان حيواني الأليف يشعر بالألم؟"
    },
    {
        "english": "What are the signs of a healthy pet?",
        "arabic": "ما هي علامات الحيوان الأليف الصحي؟"
    },
    {
        "english": "Is my pet overweight? How can I help them lose weight?",
        "arabic": "هل حيواني الأليف يعاني من زيادة الوزن؟ كيف يمكنني مساعدتهم في فقدان الوزن؟"
    },
    {
        "english": "What are the symptoms of an allergic reaction in pets?",
        "arabic": "ما هي أعراض الحساسية عند الحيوانات الأليفة؟"
    },
    {
        "english": "Spaying and neutering can help control the pet population.",
        "arabic": "التعقيم والخصي يمكن أن يساعد في السيطرة على تعداد الحيوانات الأليفة."
    },
    {
        "english": "How do I take care of my pet's dental health?",
        "arabic": "كيف أعتني بصحة أسنان حيواني الأليف؟"
    },
    {
        "english": "What should I do if my pet has a fever?",
        "arabic": "ماذا يجب أن أفعل إذا كان حيواني الأليف يعاني من الحمى؟"
    },
    {
        "english": "How do I prevent fleas and ticks on my pet?",
        "arabic": "كيف أمنع البراغيث والقراد عن حيواني الأليف؟"
    },
    {
        "english": "My pet seems lethargic, should I be concerned?",
        "arabic": "يبدو حيواني الأليف كسولًا، هل يجب أن أكون قلقًا؟"
    },
    {
        "english": "What are the common symptoms of heartworm in pets?",
        "arabic": "ما هي الأعراض الشائعة لدودة القلب عند الحيوانات الأليفة؟"
    },
    {
        "english": "How can I make my pet more comfortable during travel?",
        "arabic": "كيف يمكنني جعل حيواني الأليف أكثر راحة أثناء السفر؟"
    },
    {
        "english": "What kind of toys are safe for my pet?",
        "arabic": "ما نوع الألعاب الآمنة لحيواني الأليف؟"
    },
    {
        "english": "How do I train my pet to behave properly?",
        "arabic": "كيف أدرب حيواني الأليف على التصرف بشكل صحيح؟"
    },
    {
        "english": "What are the benefits of microchipping my pet?",
        "arabic": "ما هي فوائد وضع الشريحة الإلكترونية لحيواني الأليف؟"
    },
    {
        "english": "What should I do if my pet has ingested a toxic substance?",
        "arabic": "ماذا يجب أن أفعل إذا تناول حيواني الأليف مادة سامة؟"
    },
    {
        "english": "How can I help my pet cope with anxiety?",
        "arabic": "كيف يمكنني مساعدة حيواني الأليف على التعامل مع القلق؟"
    },
    {
        "english": "What is the best way to introduce a new pet to the family?",
        "arabic": "ما هي أفضل طريقة لتعريف حيوان أليف جديد بالعائلة؟"
    },
    {
        "english": "How do I recognize signs of dehydration in my pet?",
        "arabic": "كيف أتعرف على علامات الجفاف عند حيواني الأليف؟"
    },
    {
        "english": "How can I improve my pet's coat health?",
        "arabic": "كيف يمكنني تحسين صحة فرو حيواني الأليف؟"
    },
    {
        "english": "What are the common signs of diabetes in pets?",
        "arabic": "ما هي العلامات الشائعة لمرض السكري عند الحيوانات الأليفة؟"
    },
    {
        "english": "How do I administer medication to my pet?",
        "arabic": "كيف أعطي الدواء لحيواني الأليف؟"
    },
    {
        "english": "What is the best way to clean my pet's ears?",
        "arabic": "ما هي أفضل طريقة لتنظيف أذني حيواني الأليف؟"
    },
    {
        "english": "What kind of exercise does my pet need?",
        "arabic": "ما نوع التمارين التي يحتاجها حيواني الأليف؟"
    },
    {
        "english": "How do I care for a senior pet?",
        "arabic": "كيف أعتني بحيوان أليف مسن؟"
    },
    {
        "english": "What are the benefits of pet insurance?",
        "arabic": "ما هي فوائد تأمين الحيوانات الأليفة؟"
    },
    {
        "english": "How can I help my pet during fireworks or thunderstorms?",
        "arabic": "كيف يمكنني مساعدة حيواني الأليف أثناء الألعاب النارية أو العواصف الرعدية؟"
    },
    {
        "english": "What are the risks of my pet being overweight?",
        "arabic": "ما هي مخاطر زيادة وزن حيواني الأليف؟"
    },
    {
        "english": "How do I clean my pet's teeth?",
        "arabic": "كيف أنظف أسنان حيواني الأليف؟"
    },
    {
        "english": "What are the signs of an ear infection in pets?",
        "arabic": "ما هي علامات التهاب الأذن عند الحيوانات الأليفة؟"
    },
    {
        "english": "What vaccinations does my pet need?",
        "arabic": "ما هي التطعيمات التي يحتاجها حيواني الأليف؟"
    },
    {
        "english": "How can I tell if my pet is stressed?",
        "arabic": "كيف أعرف إذا كان حيواني الأليف مضغوطًا؟"
    },
    {
        "english": "What are the best practices for grooming my pet?",
        "arabic": "ما هي أفضل الممارسات للعناية بمظهر حيواني الأليف؟"
    },
    {
        "english": "How do I recognize signs of arthritis in my pet?",
        "arabic": "كيف أتعرف على علامات التهاب المفاصل عند حيواني الأليف؟"
    },
    {
        "english": "What should I do if my pet has a seizure?",
        "arabic": "ماذا يجب أن أفعل إذا تعرض حيواني الأليف لنوبة صرع؟"
    },
    {
        "english": "How do I prevent my pet from getting parasites?",
        "arabic": "كيف أمنع حيواني الأليف من الإصابة بالطفيليات؟"
    },
    {
        "english": "What should I include in a first aid kit for my pet?",
        "arabic": "ماذا يجب أن أضم في حقيبة الإسعافات الأولية لحيواني الأليف؟"
    },
    {
        "english": "What are the common signs of cancer in pets?",
        "arabic": "ما هي العلامات الشائعة للسرطان عند الحيوانات الأليفة؟"
    },
    {
        "english": "How do I keep my pet safe during hot weather?",
        "arabic": "كيف أحافظ على سلامة حيواني الأليف خلال الطقس الحار؟"
    },
    {
        "english": "What is the best diet for my senior pet?",
        "arabic": "ما هو أفضل نظام غذائي لحيواني الأليف المسن؟"
    },
    {
        "english": "How do I care for my pet after surgery?",
        "arabic": "كيف أعتني بحيواني الأليف بعد الجراحة؟"
    }
]
